In [16]:
import pandas as pd
apple=pd.Series([3,2,0,1],index=['one','two','three','four'])
orange=pd.Series([3,4,7,8],index=['one','two','three','four'])
lis=[3,4,5,6]
data={'apples': apple , 'oranges':orange}
print(data)
print('\n')
fruits=pd.DataFrame(data)
print(fruits)

{'apples': one      3
two      2
three    0
four     1
dtype: int64, 'oranges': one      3
two      4
three    7
four     8
dtype: int64}


       apples  oranges
one         3        3
two         2        4
three       0        7
four        1        8

In [17]:
import numpy as np
import pandas as pd
rng=np.arange(len(fruits))
print(rng)
fruits['oranges']=rng
fruits

[0 1 2 3]

       apples  oranges
one         3        0
two         2        1
three       0        2
four        1        3

In [24]:
#dataframe se list nikalne ke liye
print(fruits.values)

[[3 0]
 [2 1]
 [0 2]
 [1 3]]

In [30]:
obje3=pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obje3)
obje3=obje3.reindex(range(9),method='ffill')
#ffill purane wale nan value likh de ga
obje3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [40]:
states =pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','b','c'], columns=['ohio','texas','california'])
print(states)
states=states.reindex(['a','b','c','d','e','f'], method='ffill')
states

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8
e     6      7           8
f     6      7           8

In [47]:
states =pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','b','c'], columns=['ohio','texas','california'])
print(states)
state_name=['ohio','utha','texas','california']
states=states.reindex(columns=state_name).ffill(axis=1)
states

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

   ohio  utha  texas  california
a   0.0   0.0    1.0         2.0
b   3.0   3.0    4.0         5.0
c   6.0   6.0    7.0         8.0

In [51]:
#column drop krne ke liye
states=states.drop('utha',axis=1)
#states=states.drop('utha',axis=1 , inplace= True)
states

   ohio  texas  california
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0

In [105]:
#loc label pr kaam krta
#iloc number pr kaam krta

data_df=pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['ohio','colorado','utah','new york']
                    ,columns=['one','two','three','four'])
print(data_df)
print(data_df.loc[['colorado'],('two','three')])

print(data_df.loc[:,('two','three')])
print('\n\n')
print(data_df.iloc[0:3,[0,1]])

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15
          two  three
colorado    5      6
          two  three
ohio        1      2
colorado    5      6
utah        9     10
new york   13     14



          one  two
ohio        0    1
colorado    4    5
utah        8    9